{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "border_mode": "same", "nb_col": 5, "batch_input_shape": [null, 64, 64, 3], "subsample": [2, 2], "W_regularizer": null, "bias": true, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "nb_filter": 32, "activation": "linear", "name": "convolution2d_10", "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_16", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "border_mode": "valid", "nb_col": 3, "name": "convolution2d_11", "W_regularizer": null, "bias": true, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "nb_filter": 16, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_17", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_10", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "border_mode": "valid", "nb_col": 3, "name": "convolution2d_12", "W_regularizer": null, "bias": true, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "nb_filter": 16, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_18", "alpha": 1.0, "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.4, "name": "dropout_11", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_10", "activity_regularizer": null, "input_dim": 2704, "W_regularizer": null, "bias": true, "b_regularizer": null, "b_constraint": null, "output_dim": 1024, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_12", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_19", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_11", "activity_regularizer": null, "input_dim": 1024, "W_regularizer": null, "bias": true, "b_regularizer": null, "b_constraint": null, "output_dim": 512, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_20", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_12", "activity_regularizer": null, "input_dim": 512, "W_regularizer": null, "bias": true, "b_regularizer": null, "b_constraint": null, "output_dim": 1, "trainable": true, "activation": "linear", "init": "glorot_uniform", "W_constraint": null}}]}