{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "trainable": true, "name": "convolution2d_1", "input_dtype": "float32", "activation": "linear", "nb_row": 5, "init": "glorot_uniform", "border_mode": "same", "activity_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "b_regularizer": null, "nb_filter": 32, "b_constraint": null, "nb_col": 5, "dim_ordering": "tf", "W_regularizer": null, "subsample": [2, 2], "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"bias": true, "trainable": true, "name": "convolution2d_2", "b_constraint": null, "activation": "linear", "nb_row": 3, "init": "glorot_uniform", "border_mode": "valid", "activity_regularizer": null, "nb_filter": 16, "b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"bias": true, "trainable": true, "name": "convolution2d_3", "b_constraint": null, "activation": "linear", "nb_row": 3, "init": "glorot_uniform", "border_mode": "valid", "activity_regularizer": null, "nb_filter": 16, "b_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"p": 0.4, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "name": "dense_1", "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 2704, "activity_regularizer": null, "output_dim": 1024, "b_regularizer": null, "W_regularizer": null, "W_constraint": null}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "name": "dense_2", "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 1024, "activity_regularizer": null, "output_dim": 512, "b_regularizer": null, "W_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"bias": true, "trainable": true, "name": "dense_3", "b_constraint": null, "activation": "linear", "init": "glorot_uniform", "input_dim": 512, "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "W_regularizer": null, "W_constraint": null}}], "keras_version": "1.2.1"}